src/Catalogs/ВидыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыКарт</Name>
			<Comment>Виды карт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Именная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПроекта</Name>
					<Comment>Используется для карт с типом Wallet</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЖизниКартыВМесяцах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВидыКарт/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	РедактированиеДоступно = РедактированиеДоступно();
	ЭтаФорма.Доступность   = РедактированиеДоступно;
	
	Элементы.КнопкаИменная.Доступность  = РедактированиеДоступно;
	Элементы.НаПредъявителя.Доступность = РедактированиеДоступно;
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
	ВнешняяСистемаWallet = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Wallet);			

	ЭтотОбъект.ВСНастроена = Константы.ИспользоватьWallet.Получить() И ЗначениеЗаполнено(ВнешняяСистемаWallet.КлючШифрования) И ЗначениеЗаполнено(ВнешняяСистемаWallet.ТокенДоступа);
			
	Элементы.ДекорацияЗаглушка2.Ширина = ?(ЭтотОбъект.ВСНастроена, 11, 8);
	
	ИспользуемыйВидКарт = Константы.ИспользуемыйВидКарт.Получить();
	
	Если Не ЗначениеЗаполнено(Объект.ТипКода) Тогда
		
		Объект.ТипКода = ?(ИспользуемыйВидКарт = Перечисления.ВидыКарт.Wallet И ЭтотОбъект.ВСНастроена, ИспользуемыйВидКарт, Перечисления.ВидыКарт.Штриховая);
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда		
		Объект.ШаблонСообщения = Справочники.ШаблоныСообщений.СозданиеКарты;			
	КонецЕсли;
	
	Элементы.ГруппаЭлектроннаяКарта.Видимость = ЭтотОбъект.ВСНастроена Или ЗначениеЗаполнено(Объект.ИдентификаторПроекта);
	
	Элементы.ГруппаВыборТипаКарты.Доступность = Не ЗначениеЗаполнено(Объект.ИдентификаторПроекта);
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекущийВидКарты();
	
	АктивныйЭлемент   = ?(Объект.Именная, Элементы.ГруппаКнопкаИменная       , Элементы.ГруппаКнопкаНаПредъявителя);
	НеАктивныйЭлемент = ?(Объект.Именная, Элементы.ГруппаКнопкаНаПредъявителя, Элементы.ГруппаКнопкаИменная);
	
	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент, НеАктивныйЭлемент,, ЭтаФорма, Элементы.ДекорацияШтриховаяКарта);
	
КонецПроцедуры

&НаКлиенте
// Процедура, устанавливает текущий вид карт.
//
Процедура УстановитьТекущийВидКарты()
	
	Элементы.ГруппаЭлектроннаяКарта.ЦветФона = Новый Цвет(255, 255, 255);
	Элементы.ГруппаМагнитнаяКарта.ЦветФона   = Новый Цвет(255, 255, 255);
	Элементы.ГруппаШтриховаяКарта.ЦветФона   = Новый Цвет(255, 255, 255);
	
	Если Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Wallet") Тогда	
		Элементы.ГруппаЭлектроннаяКарта.ЦветФона = Новый Цвет(195, 217, 246);	
	ИначеЕсли Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Магнитная") Тогда
		Элементы.ГруппаМагнитнаяКарта.ЦветФона = Новый Цвет(195, 217, 246);
	Иначе
		Элементы.ГруппаШтриховаяКарта.ЦветФона = Новый Цвет(195, 217, 246);
	КонецЕсли;
	
	ЭлектронныйВидКарты = Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Wallet");
	
	Если Не ЗначениеЗаполнено(Объект.ИдентификаторПроекта) И ЭлектронныйВидКарты И ЭтотОбъект.ВСНастроена Тогда
		Если Элементы.Нумератор.СписокВыбора.Количество() = 0 Тогда
			ЗаполнитьНумераторы();	
		КонецЕсли;
		Если Элементы.Сертификат.СписокВыбора.Количество() = 0 Тогда
			ЗаполнитьСертификаты();	
		КонецЕсли;
		Элементы.ГруппаНумератор.Видимость = Истина;
		Элементы.Сертификат.Видимость = Истина;
	Иначе
		Элементы.ГруппаНумератор.Видимость = Ложь;
		Элементы.Сертификат.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ШаблонСообщений.Видимость = ЭлектронныйВидКарты;
	Элементы.ДекорацияЗаглушка2.Ширина = ?(ЭлектронныйВидКарты, 11, 8);
	Элементы.ДекорацияЗаглушка.Ширина  = ?(ЭлектронныйВидКарты, 11, 8);
	
	Элементы.ГруппаТумблер.Доступность = Не ЭлектронныйВидКарты;
	Элементы.Наименование.Доступность  = Не ЗначениеЗаполнено(Объект.ИдентификаторПроекта);
		
	Если ЭлектронныйВидКарты Тогда
		
		Если РедактированиеДоступно Тогда
			Объект.Именная = Истина;
		КонецЕсли;
		
		УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(Элементы.ГруппаКнопкаИменная, Элементы.ГруппаКнопкаНаПредъявителя,, ЭтаФорма, Элементы.ДекорацияШтриховаяКарта);
		
		Если Не ЗначениеЗаполнено(Объект.ШаблонСообщения)
			И РедактированиеДоступно Тогда
			
			Объект.ШаблонСообщения = ПредопределенноеЗначение("Справочник.ШаблоныСообщений.СозданиеКарты");
			
		КонецЕсли;
		
	ИначеЕсли РедактированиеДоступно Тогда
		
		Объект.ШаблонСообщения = Неопределено;
		
	КонецЕсли;
	
	Элементы.НастроитьКарту.Видимость     = ЗначениеЗаполнено(Объект.ИдентификаторПроекта) И ЭлектронныйВидКарты;
	Элементы.ГруппаКоманднаяПанель.Ширина = ?(Элементы.НастроитьКарту.Видимость, 37, 17);
	Элементы.НастроитьКарту.Доступность   = ПолныеПрава();
	
	Элементы.ГруппаДеактивацияКарты.Видимость = ЭлектронныйВидКарты;
			
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает признак доступности изменения.
//
Функция РедактированиеДоступно()
	
	Возврат ПравоДоступа("Редактирование", Метаданные.Справочники.ВидыКарт);
	
КонецФункции

&НаСервере
// Функция, возвращает Истина если пользователь имеет Роль - Полные права, в противном случае возвращает Ложь.
//
Функция  ПолныеПрава()
	
	Возврат РольДоступна("ПолныеПрава");
	
КонецФункции

// Процедура - После записи на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Скрыть показать дополнительно
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = НЕ Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Настроить карту
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура НастроитьКарту(Команда)
  
  //Ссылка = "https://webcitrus.app/tools/{client_id}/pass-designer/{project_id}?client_secret={client_secret}&1c";
  //
  //РеквизитыВнешнейСистемы = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ВнешняяСистемаWallet, "ТокенДоступа, КлючШифрования");
  //
  //Ссылка = СтрЗаменить(Ссылка, "{client_id}"    , РеквизитыВнешнейСистемы.ТокенДоступа);
  //Ссылка = СтрЗаменить(Ссылка, "{project_id}"   , Объект.ИдентификаторПроекта);
  //Ссылка = СтрЗаменить(Ссылка, "{client_secret}", РеквизитыВнешнейСистемы.КлючШифрования);
  //
  //ПерейтиПоНавигационнойСсылке(Ссылка);
  
  ОткрытьФорму("Справочник.ВнешниеСистемы.Форма.ФормаНастройкиЭлектронныхКартWallet", Новый Структура("ИдПроекта, Ключ", Объект.ИдентификаторПроекта, ЭтотОбъект.ВнешняяСистемаWallet));
  
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ТипКода = Перечисления.ВидыКарт.Wallet
		И Не ЗначениеЗаполнено(Объект.ИдентификаторПроекта) Тогда
		
		Результат = Справочники.Карты.СоздатьПроектWallet(ВнешняяСистемаWallet, ТекущийОбъект.Наименование, ЭтотОбъект.Нумератор, ЭтотОбъект.Сертификат); 
		
		Если Результат.Успешно Тогда
			
			ТекущийОбъект.ИдентификаторПроекта = Результат.id;
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки,,,, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ДобавленИзмененВидКарт", Объект.ИдентификаторПроекта > 0);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ДекорацияЭлектроннаяКартаНажатие".
//
Процедура ДекорацияЭлектроннаяКартаНажатие(Элемент)
	
	Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Wallet");	
		
	УстановитьТекущийВидКарты();
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ДекорацияМагнитнаяКартаНажатие".
//
Процедура ДекорацияМагнитнаяКартаНажатие(Элемент)
	
	Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Магнитная");
	
	УстановитьТекущийВидКарты();
	
	ЭтаФорма.Модифицированность = Истина
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ДекорацияШтриховаяКартаНажатие".
//
Процедура ДекорацияШтриховаяКартаНажатие(Элемент)
	
	Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Штриховая");
	
	УстановитьТекущийВидКарты();
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "Именная".
//
Процедура Именная(Команда)
	
	Объект.Именная = Истина;
	
	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(Элементы.ГруппаКнопкаИменная, Элементы.ГруппаКнопкаНаПредъявителя,, ЭтаФорма, Элементы.ДекорацияШтриховаяКарта);	
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "НаПредъявителя".
//
Процедура НаПредъявителя(Команда)
	
	Объект.Именная = Ложь;
	
	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(Элементы.ГруппаКнопкаНаПредъявителя, Элементы.ГруппаКнопкаИменная,, ЭтаФорма, Элементы.ДекорацияШтриховаяКарта);		
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
// Процедура, заполняет нумераторы.
//
Процедура ЗаполнитьНумераторы()
	
	Результат = Справочники.Карты.ПолучитьНумераторыЭлектронныхКарт(ЭтотОбъект.ВнешняяСистемаWallet);
	
	Если Результат.Успешно Тогда
		
		Элементы.Нумератор.СписокВыбора.Очистить();
		Для Каждого НумераторСтруктура Из Результат.data Цикл
			Элементы.Нумератор.СписокВыбора.Добавить(НумераторСтруктура.id, НумераторСтруктура.name);	
		КонецЦикла;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет сертификаты.
//
Процедура ЗаполнитьСертификаты()
	
	Результат = Справочники.Карты.ПолучитьСертификатыЭлектронныхКарт(ЭтотОбъект.ВнешняяСистемаWallet);
	
	Если Результат.Успешно Тогда
		
		Элементы.Сертификат.СписокВыбора.Очистить();
		Для Каждого СертификатСтруктура Из Результат.data Цикл
			Элементы.Сертификат.СписокВыбора.Добавить(СертификатСтруктура.id, СертификатСтруктура.name);	
		КонецЦикла;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик проверки заполнения.
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.ТипКода = Перечисления.ВидыКарт.Wallet
		И Не ЗначениеЗаполнено(Объект.ИдентификаторПроекта) Тогда
		Если Не ЗначениеЗаполнено(ЭтотОбъект.Нумератор) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен нумератор",,,, Отказ);
		ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект.Сертификат) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен сертификат",,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ДобавитьНумератор".
// 
Процедура ДобавитьНумератор(Команда)
	
	ОткрытьФорму("Справочник.ВидыКарт.Форма.ФормаДобавленияНумератора", Новый Структура("ВСWallet", ЭтотОбъект.ВнешняяСистемаWallet),,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события формы "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьНумераторы"
		И Элементы.ГруппаНумератор.Видимость Тогда
		ЗаполнитьНумераторы();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
